#include "main/audio/sfx_ids.h"
#include "main/effect_interfaces.h"
#include "main/expgfx.h"
#include "main/game_object.h"
#include "main/mapEvent.h"
#include "main/objanim_internal.h"
#include "main/dll/DR/DRpushcart.h"
#include "main/objseq.h"
#include "main/screen_transition.h"

typedef struct ShopitemState {
    u8 pad0[0x88 - 0x0];
    s16 unk88;
    u8 pad8A[0xEC - 0x8A];
} ShopitemState;


typedef struct ShopitemPlacement {
    u8 pad0[0x19 - 0x0];
    u8 unk19;
    u8 pad1A[0x20 - 0x1A];
} ShopitemPlacement;


/* shopitem_getExtraSize == 0xec (spline-following pushcart item). */
typedef struct ShopItemState {
    u8 pad00[4];
    f32 controlX[4];  /* 0x04: B-spline control ring (address-passed, raw) */
    f32 controlY[4];  /* 0x14 */
    f32 controlZ[4];  /* 0x24 */
    u8 pad34[0xC];
    f32 splineT;      /* 0x40 */
    f32 splineSpeed;  /* 0x44 */
    u8 pad48[0x20];
    u8 segCounter;    /* 0x68 */
    u8 pad69[0x1F];
    s16 msgParam;     /* 0x88: ObjMsg payload (address-used, raw) */
    u8 pad8A[6];
    int vendorObj;    /* 0x90: nearest group-9 shop manager */
    s16 helpTextId;   /* 0x94 */
    u8 pad96;
    u8 flags97;       /* 0x97: PushcartState97 overlay */
    u8 pad98[0xEC - 0x98];
} ShopItemState;
STATIC_ASSERT(sizeof(ShopItemState) == 0xEC);

/* shopkeeper_getExtraSize == 0x9d8. */
typedef struct ShopkeeperState {
    u8 pad000[0x280];
    f32 animSpeed;    /* 0x280 */
    u8 pad284[0x35C - 0x284];
    u8 dll2EBlock[0x96D - 0x35C]; /* 0x35c: dll_2E look-controller block (address-used) */
    u8 unk96D;        /* 0x96d */
    u8 pad96E[0x980 - 0x96E];
    u8 eyeAnimBlock[0x9B0 - 0x980]; /* 0x980: characterDoEyeAnims block (address-used) */
    void *msgStack;   /* 0x9b0: Stack_Free'd on free */
    int vendorObj;    /* 0x9b4: nearest group-9 shop manager */
    f32 unk9B8;       /* 0x9b8 */
    u8 pad9BC[8];
    f32 textTimer;    /* 0x9c4: gameTextShow 0x433 countdown */
    s16 playerMoney;  /* 0x9c8 */
    u8 pad9CA[2];
    s16 price;        /* 0x9cc */
    s16 unk9CE;       /* 0x9ce */
    s16 priceShown;   /* 0x9d0 */
    u8 unk9D2;        /* 0x9d2 */
    u8 pad9D3;
    u8 flags9D4;      /* 0x9d4: 2 purchased-event, 4 facing, 0x10 leave, 0x20 tick */
    u8 amount;        /* 0x9d5 */
    u8 opacity;       /* 0x9d6: copied to obj alpha */
    u8 pad9D7;
} ShopkeeperState;
STATIC_ASSERT(sizeof(ShopkeeperState) == 0x9D8);
STATIC_ASSERT(offsetof(ShopkeeperState, msgStack) == 0x9B0);


extern undefined4 FUN_80006824();
extern double FUN_80006a38();
extern undefined4 FUN_80006ac8();
extern undefined4 FUN_80006acc();
extern undefined4 FUN_80006b50();
extern undefined4 FUN_80006b54();
extern undefined4 FUN_80006b74();
extern int FUN_80006b7c();
extern undefined4 FUN_80006bb4();
extern uint FUN_80006c00();
extern undefined4 FUN_80006c88();
extern uint GameBit_Get(int eventId);
extern undefined4 GameBit_Set(int eventId, int value);
extern int FUN_800176d0();
extern uint FUN_80017730();
extern u32 randomGetRange(int min, int max);
extern int FUN_8001792c();
extern undefined4 FUN_80017a54();
extern int FUN_80017a98();
extern void* FUN_80017aa4();
extern undefined4 FUN_80017ae4();
extern uint FUN_80017ae8();
extern undefined4 FUN_8002fc3c();
