#ifndef MAIN_DLL_PLAYER_DATA_H_
#define MAIN_DLL_PLAYER_DATA_H_

#include "main/game_object.h"
#include "main/lightmap_api.h"

typedef struct PlayerModelChainEntry
{
    int* modelIds;
    int count;
} PlayerModelChainEntry;

extern void* gPlayerPathObject;
extern u8 gPlayerSubState;
extern void* gPlayerSpawnedObjects[];
extern void* gPlayerResource;
extern int gPlayerPendingHealth;
extern f32 gPlayerDegToBinAngle;
extern GameObject* gPlayerStaffObject;
extern s16 gPlayerMoveTableC[];
extern f32 gPlayerMoveSpeedTable[];
extern s16 gPlayerCurrentMoveId;
extern s16 gPlayerPrevMoveId;
extern u16 gPlayerHeldButtonMask;
extern f32 gPlayerPi;
extern f32 gPlayerPi2;
extern int gPlayerEggObject;
extern int gPlayerModelChain;
extern int gPlayerSfxTimerA;
extern int gPlayerSfxTimerB;
extern int gPlayerSfxTimerC;
extern int gPlayerSfxTimerD;
extern int gPlayerStepSfxTimer;
extern s16 gPlayerSelectedItem;
extern int gPlayerStateHandlers[];
extern int gPlayerDefaultStateHandler;
extern void* gPlayerChildObject;
extern PlayerModelChainEntry* gPlayerModelChainConfig;
extern int gPlayerHeldObject;
extern f32 gPlayerPartFxParams[];
extern LightmapVertex gPlayerHudVtxBuf[8];
extern s16 gPlayerStopMoves[4];
extern u8 gPlayerSurfacePfxModeTable[];
extern u64 gPlayerLastSfxFrame;
extern u64 gPlayerFrameCounter;

typedef struct PlayerMoveSlot
{
    u8 slotId;
    u8 unk01;
    s16 moveTableIndex;
    s16 unk04;
    s16 unk06;
    int hitWindowFlags[3];
    u8 hitVolumeId;
    s8 nextMoveSlots[5];
    u8 unk1A[2];
    f32 moveSpeed;
    f32 comboWindowOpen;
    f32 comboWindowClose;
    f32 attackLandProgress;
    f32 transitionProgress;
    f32 hitWindowStart[3];
    f32 hitWindowEnd[3];
    f32 unk48;
    f32 unk4C;
    f32 sfxProgressA;
    f32 sfxProgressB;
    f32 unk58;
    u8 unk5C;
    s8 hitWindowType[3];
    ObjWeaponDaTable weaponDa;
    f32 animSpeed;
    u8 chainBreakFlag;
    u8 unk6D[3];
    f32 hitWindowUnk70[3];
    f32 hitWindowUnk7C[3];
    u8 flags88;
    u8 unk89[3];
    f32 unk8C;
    s8 unk90;
    u8 unk91[3];
    f32 hitWindowUnk94[3];
    f32 unkA0;
    f32 unkA4;
    u8 unkA8[8];
} PlayerMoveSlot;

STATIC_ASSERT(sizeof(PlayerMoveSlot) == 0xb0);
STATIC_ASSERT(offsetof(PlayerMoveSlot, moveTableIndex) == 0x02);
STATIC_ASSERT(offsetof(PlayerMoveSlot, hitWindowFlags) == 0x08);
STATIC_ASSERT(offsetof(PlayerMoveSlot, hitVolumeId) == 0x14);
STATIC_ASSERT(offsetof(PlayerMoveSlot, nextMoveSlots) == 0x15);
STATIC_ASSERT(offsetof(PlayerMoveSlot, moveSpeed) == 0x1c);
STATIC_ASSERT(offsetof(PlayerMoveSlot, comboWindowOpen) == 0x20);
STATIC_ASSERT(offsetof(PlayerMoveSlot, comboWindowClose) == 0x24);
STATIC_ASSERT(offsetof(PlayerMoveSlot, attackLandProgress) == 0x28);
STATIC_ASSERT(offsetof(PlayerMoveSlot, transitionProgress) == 0x2c);
STATIC_ASSERT(offsetof(PlayerMoveSlot, hitWindowStart) == 0x30);
STATIC_ASSERT(offsetof(PlayerMoveSlot, hitWindowEnd) == 0x3c);
STATIC_ASSERT(offsetof(PlayerMoveSlot, unk48) == 0x48);
STATIC_ASSERT(offsetof(PlayerMoveSlot, sfxProgressA) == 0x50);
STATIC_ASSERT(offsetof(PlayerMoveSlot, sfxProgressB) == 0x54);
STATIC_ASSERT(offsetof(PlayerMoveSlot, hitWindowType) == 0x5d);
STATIC_ASSERT(offsetof(PlayerMoveSlot, weaponDa) == 0x60);
STATIC_ASSERT(offsetof(PlayerMoveSlot, animSpeed) == 0x68);
STATIC_ASSERT(offsetof(PlayerMoveSlot, chainBreakFlag) == 0x6c);
STATIC_ASSERT(offsetof(PlayerMoveSlot, hitWindowUnk70) == 0x70);
STATIC_ASSERT(offsetof(PlayerMoveSlot, hitWindowUnk7C) == 0x7c);
STATIC_ASSERT(offsetof(PlayerMoveSlot, flags88) == 0x88);
STATIC_ASSERT(offsetof(PlayerMoveSlot, hitWindowUnk94) == 0x94);
STATIC_ASSERT(offsetof(PlayerMoveSlot, unkA0) == 0xa0);
STATIC_ASSERT(offsetof(PlayerMoveSlot, unkA4) == 0xa4);

extern PlayerMoveSlot gPlayerMoveSlotData[28];
typedef struct PlayerAnimSpeedTuning
{
    f32 gaitSpeedThresholds[6];
    f32 bodyCollisionPoints[2][3];
    f32 groundCollisionPoint[3];
    int mountableObjectIds[9];
    int rideableObjectIds[4];
    f32 foxStopMoveSpeeds[4];
    f32 krystalStopMoveSpeeds[4];
} PlayerAnimSpeedTuning;

STATIC_ASSERT(sizeof(PlayerAnimSpeedTuning) == 0x90);
STATIC_ASSERT(offsetof(PlayerAnimSpeedTuning, bodyCollisionPoints) == 0x18);
STATIC_ASSERT(offsetof(PlayerAnimSpeedTuning, groundCollisionPoint) == 0x30);
STATIC_ASSERT(offsetof(PlayerAnimSpeedTuning, mountableObjectIds) == 0x3c);
STATIC_ASSERT(offsetof(PlayerAnimSpeedTuning, rideableObjectIds) == 0x60);
STATIC_ASSERT(offsetof(PlayerAnimSpeedTuning, foxStopMoveSpeeds) == 0x70);
STATIC_ASSERT(offsetof(PlayerAnimSpeedTuning, krystalStopMoveSpeeds) == 0x80);

extern PlayerAnimSpeedTuning gPlayerAnimSpeedThresholds;
extern s16 gPlayerMoveTableA[96];
extern s16 gPlayerSpellGameBits[52];
extern s16 gPlayerMoveTableB[14];
extern s16 gPlayerMoveSlotTable[44];
extern GameObject* gPlayerInteractTarget;

extern int lbl_80332EC0[];
extern s16 lbl_80332EF0[];
extern s16 lbl_80332F2C[];
extern s16 lbl_80332F48[];
extern s16 lbl_80332F78[];
extern s16 lbl_80332F88[];
extern s16 lbl_80333110[];
extern f32 lbl_80333250[24];
typedef struct PlayerMotionTuning
{
    s16 moveSequences[4][12];
    f32 velSmoothRateCurve[41];
    f32 targetYawSmoothRateCurve[41];
    f32 targetYawRateLimitCurve[46];
    f32 yawSmoothRateCurve[41];
    f32 yawRateLimitCurve[46];
} PlayerMotionTuning;

STATIC_ASSERT(sizeof(PlayerMotionTuning) == 0x3bc);
STATIC_ASSERT(offsetof(PlayerMotionTuning, velSmoothRateCurve) == 0x60);
STATIC_ASSERT(offsetof(PlayerMotionTuning, targetYawSmoothRateCurve) == 0x104);
STATIC_ASSERT(offsetof(PlayerMotionTuning, targetYawRateLimitCurve) == 0x1a8);
STATIC_ASSERT(offsetof(PlayerMotionTuning, yawSmoothRateCurve) == 0x260);
STATIC_ASSERT(offsetof(PlayerMotionTuning, yawRateLimitCurve) == 0x304);

extern PlayerMotionTuning lbl_803332B0;
extern s16 lbl_8033366C[];
extern f32 lbl_8033369C[];
extern f32 lbl_803DAF88[];
extern f32 lbl_803DC670;
extern f32 lbl_803DC674;
extern f32 lbl_803DC678;
extern f32 lbl_803DC67C;
extern f32 lbl_803DC680;
extern f32 lbl_803DC684;
extern int lbl_803DC688;
extern f32 lbl_803DC690;
extern s16 lbl_803DC698;
extern s16 lbl_803DC69C;
extern int lbl_803DC6A4;
extern f32 lbl_803DC6B8;
extern f32 lbl_803DC6C0;
extern s16 lbl_803DC6C4;
extern f32 lbl_803DC6D4;
extern f32 lbl_803DC6D8;
extern f32 lbl_803DC6DC;
extern f32 lbl_803DC6E0;
extern f32 lbl_803DC6E4;
extern u8 lbl_803DE42C;
extern f32 lbl_803DE430;
extern f32 lbl_803DE438;
extern f32 lbl_803DE43C;
extern f32 lbl_803DE440;
extern u8 lbl_803DE458;
extern u8 lbl_803DE459;
extern f32 lbl_803DE45C;
extern f32 lbl_803DE460;
extern f32 lbl_803DE464;
extern f32 lbl_803DE468;
extern s8 lbl_803DE46C;
extern f32 lbl_803DE478;
extern f32 lbl_803DE488;
extern u8 lbl_803DE48C;
extern u8 lbl_803DE48D;
extern f32 lbl_803DE490;
extern f32 lbl_803DE494;
extern f32 lbl_803DE498;
extern s16 lbl_803DE4B0;

extern const u8 lbl_802C2B30[][16];
extern const f32 lbl_802C2BF0[];
extern f32 lbl_803E7E80;
extern f32 lbl_803E7E84;
extern f32 lbl_803E7E88;
extern f32 lbl_803E7E8C;
extern f32 lbl_803E7E90;
extern f32 lbl_803E7E94;
extern f32 lbl_803E7E98;
extern f32 lbl_803E7E9C;
extern f32 lbl_803E7EA0;
extern f32 lbl_803E7EA4;
extern f32 lbl_803E7EA8;
extern f32 lbl_803E7EAC;
extern f32 lbl_803E7EB0;
extern f32 lbl_803E7EB4;
extern f32 lbl_803E7EB8;
extern f32 lbl_803E7EBC;
extern f32 lbl_803E7EC8;
extern f32 lbl_803E7ECC;
extern f32 lbl_803E7ED0;
extern f32 lbl_803E7ED4;
extern const f32 lbl_803E7ED8;
extern f32 lbl_803E7EDC;
extern const f32 lbl_803E7EE0;
extern f32 lbl_803E7EE4;
extern f32 lbl_803E7EE8;
extern f32 lbl_803E7EEC;
extern f32 lbl_803E7EF0;
extern f32 lbl_803E7EF4;
extern f32 lbl_803E7EF8;
extern f32 lbl_803E7EFC;
extern f32 lbl_803E7F04;
extern f32 lbl_803E7F08;
extern f32 lbl_803E7F0C;
extern f32 lbl_803E7F10;
extern f32 lbl_803E7F14;
extern f32 lbl_803E7F18;
extern f32 lbl_803E7F1C;
extern f32 lbl_803E7F20;
extern f32 lbl_803E7F24;
extern f32 lbl_803E7F28;
extern f32 lbl_803E7F2C;
extern f32 lbl_803E7F30;
extern f32 lbl_803E7F34;
extern f32 lbl_803E7F40;
extern f32 lbl_803E7F44;
extern f32 lbl_803E7F48;
extern f32 lbl_803E7F4C;
extern f32 lbl_803E7F50;
extern f32 lbl_803E7F54;
extern f32 lbl_803E7F58;
extern const f32 lbl_803E7F5C;
extern f32 lbl_803E7F60;
extern f32 lbl_803E7F64;
extern f32 lbl_803E7F68;
extern f32 lbl_803E7F6C;
extern f32 lbl_803E7F70;
extern f32 lbl_803E7F74;
extern f32 lbl_803E7F78;
extern f32 lbl_803E7F7C;
extern f32 lbl_803E7F80;
extern f32 lbl_803E7F84;
extern double lbl_803E7F88;
extern f32 lbl_803E7F90;
extern f32 lbl_803E7F98;
extern f32 lbl_803E7F9C;
extern f32 lbl_803E7FA0;
extern f32 lbl_803E7FA4;
extern f32 lbl_803E7FA8;
extern f32 lbl_803E7FAC;
extern f32 lbl_803E7FB0;
extern f32 lbl_803E7FB4;
extern f32 lbl_803E7FBC;
extern f32 lbl_803E7FC0;
extern f32 lbl_803E7FC4;
extern f32 lbl_803E7FC8;
extern f32 lbl_803E7FCC;
extern f32 lbl_803E7FD0;
extern f32 lbl_803E7FD4;
extern f32 lbl_803E7FD8;
extern f32 lbl_803E7FE8;
extern f32 lbl_803E7FEC;
extern f32 lbl_803E7FF0;
extern f32 lbl_803E7FF4;
extern f32 lbl_803E7FFC;
extern f32 lbl_803E8008;
extern f32 lbl_803E800C;
extern f32 lbl_803E8010;
extern f32 lbl_803E8014;
extern f32 lbl_803E8018;
extern f32 lbl_803E801C;
extern f32 lbl_803E8024;
extern f32 lbl_803E8028;
extern f32 lbl_803E802C;
extern f32 lbl_803E8038;
extern f32 lbl_803E8040;
extern f32 lbl_803E8044;
extern f32 lbl_803E8048;
extern f32 lbl_803E804C;
extern f32 lbl_803E8050;
extern f32 lbl_803E8058;
extern f32 lbl_803E805C;
extern f32 lbl_803E8060;
extern f32 lbl_803E8068;
extern f32 lbl_803E806C;
extern f32 lbl_803E8070;
extern f32 lbl_803E808C;
extern f32 lbl_803E80A8;
extern f32 lbl_803E80AC;
extern f32 lbl_803E80BC;
extern f32 lbl_803E80C4;
extern f32 lbl_803E80C8;
extern f32 lbl_803E80CC;
extern f32 lbl_803E80D0;
extern f32 lbl_803E80D4;
extern f32 lbl_803E80D8;
extern f32 lbl_803E80E0;
extern f32 lbl_803E80E4;
extern f32 lbl_803E80E8;
extern f32 lbl_803E80EC;
extern f32 lbl_803E80F4;
extern f32 lbl_803E80F8;
extern f32 lbl_803E8114;
extern f32 lbl_803E8118;
extern f32 lbl_803E811C;
extern f32 lbl_803E8124;
extern f32 lbl_803E8128;
extern f32 lbl_803E812C;
extern f32 lbl_803E8130;
extern f32 lbl_803E8138;
extern f32 lbl_803E813C;
extern f32 lbl_803E8140;
extern f32 lbl_803E8144;
extern f32 lbl_803E8148;
extern f32 lbl_803E814C;
extern f32 lbl_803E8150;
extern f32 lbl_803E8168;
extern f32 lbl_803E816C;
extern f32 lbl_803E8170;
extern f32 lbl_803E8174;
extern f32 lbl_803E8178;
extern f32 lbl_803E8184;
extern f32 lbl_803E818C;
extern f32 lbl_803E8190;
extern f32 lbl_803E8194;
extern f32 lbl_803E81A8;
extern f32 lbl_803E81AC;
extern f32 lbl_803E81B0;
extern f32 lbl_803E81B8;
extern f32 lbl_803E81BC;
extern f32 lbl_803E81CC;
extern f32 lbl_803E81D4;
extern f32 lbl_803E81D8;
extern f32 lbl_803E81DC;
extern f32 lbl_803E81E0;
extern f32 lbl_803E81E4;
extern f32 lbl_803E81E8;
extern f32 lbl_803E81EC;
extern f32 lbl_803E81F0;
extern f32 lbl_803E81F4;
extern f32 lbl_803E81F8;
extern f32 lbl_803E81FC;
extern f32 lbl_803E8200;
extern f32 lbl_803E8204;
extern f32 lbl_803E8208;
extern f32 lbl_803E820C;
extern f32 lbl_803E8210;

#endif /* MAIN_DLL_PLAYER_DATA_H_ */
